tutorials/interDyMFoam/sloshingTank/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr PCG
    {
        preconditioner   GAMG
        {
            tolerance        1e-5;
            relTol           0;

            smoother         DICGaussSeidel;
            nPreSweeps       0;
            nPostSweeps      2;
            nBottomSweeps    2;

            cacheAgglomeration false;
            nCellsInCoarsestLevel 10;
            agglomerator     faceAreaPair;
            mergeLevels      1;
        };

        tolerance        1e-5;
        relTol           0;
        maxIter          100;
    };

    pd GAMG
    {
        tolerance        1e-8;
        relTol           0.01;

        smoother         DIC;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    pdFinal PCG
    {
        preconditioner GAMG
        {
            tolerance        2e-9;
            relTol           0;

            nVcycles         2;

            smoother         DICGaussSeidel;
            nPreSweeps       2;
            nPostSweeps      2;
            nFinestSweeps    2;

            cacheAgglomeration true;
            nCellsInCoarsestLevel 10;
            agglomerator     faceAreaPair;
            mergeLevels      1;
        };

        tolerance        2e-9;
        relTol           0;
        maxIter          20;
    };

    U smoothSolver
    {
        smoother         GaussSeidel;
        tolerance        1e-6;
        relTol           0;
        nSweeps          1;
    };
}

PISO
{
    momentumPredictor no;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    nGammaCorr      1;
    nGammaSubCycles 3;
    cGamma          1.5;
    correctPhi      no;

    pRefProbe
    {
        fields
        (
            p
        );

        probeLocations
        (
            (0 0 0.15)
        );
    }

    pRefValue      1e5;
}

relaxationFactors
{
    U  1.0;
}

// ************************************************************************* //
